app/controllers/logbooks_controller.rb

SELECT "logbooks".* FROM "logbooks" WHERE "logbooks"."user_id" = ?  [["user_id", 1]]
---
  def index
    @logbooks = Logbook.where(user_id: current_user.id).all

SELECT  "logbooks".* FROM "logbooks" WHERE "logbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @logbook = Logbook.find(params[:id])

SELECT  "logbooks".* FROM "logbooks" WHERE "logbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @logbook = Logbook.find(params[:id])

INSERT INTO "logbooks" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This must be working"], ["text", "I want this to work perfect now!"], ["created_at", 2016-03-02 23:03:52 UTC], ["updated_at", 2016-03-02 23:03:52 UTC]]
---
  def create
    @logbook = Logbook.new(logbook_params)
    @logbook.user_id = current_user.id

    if @logbook.save

SELECT  "logbooks".* FROM "logbooks" WHERE "logbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "logbooks" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "logbooks"."id" = ?  [["title", "It's working"], ["text", "IT'S WORKING!! - Anakin Skywalker"], ["updated_at", 2016-03-03 14:00:07 UTC], ["id", 1]]
---
  def update
    @logbook = Logbook.find(params[:id])

    if @logbook.update(logbook_params)

SELECT  "logbooks".* FROM "logbooks" WHERE "logbooks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "logbooks" WHERE "logbooks"."id" = ?  [["id", 2]]
---
  def destroy
    @logbook = Logbook.find(params[:id])
    @logbook.destroy