app/controllers/standups_controller.rb

SELECT "standups".* FROM "standups" WHERE "standups"."user_id" = ?  [["user_id", 1]]
---
  def index
    @standups = Standup.where(user_id: current_user.id).all

SELECT  "standups".* FROM "standups" WHERE "standups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @standup = Standup.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 1]]
---
  def new
    @standup = Standup.new
    @team = Team.where(user_id: current_user.id).all

SELECT  "standups".* FROM "standups" WHERE "standups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @standup = Standup.find(params[:id])

INSERT INTO "standups" ("created_at", "updated_at", "user_id", "yesterday", "today", "problems", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", 2016-03-11 14:33:07 UTC], ["updated_at", 2016-03-11 14:33:07 UTC], ["user_id", 1], ["yesterday", "qdkkqejhfnw"], ["today", "wefkhqkew"], ["problems", "asfkhqkeh"], ["team_id", 1]]
---
  def create
    @standup = Standup.new(standup_params)
    @standup.user_id = current_user.id

    if @standup.save

SELECT  "standups".* FROM "standups" WHERE "standups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "standups" SET "yesterday" = ?, "today" = ?, "problems" = ?, "updated_at" = ? WHERE "standups"."id" = ?  [["yesterday", "ewfwefwfsfdsdfsf"], ["today", "wefwfwdfasdfaf"], ["problems", "fwyefwefwsfaefess"], ["updated_at", 2016-03-09 08:18:00 UTC], ["id", 10]]
---
  def update
    @standup = Standup.find(params[:id])

    if @standup.update(standup_params)

SELECT  "standups".* FROM "standups" WHERE "standups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "standups" WHERE "standups"."id" = ?  [["id", 3]]
---
  def destroy
    @standup = Standup.find(params[:id])
    @standup.destroy