app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 1]]
---
    def index
      @teams = Team.where(user_id: current_user.id).all

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @team = Team.find(params[:id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @team = Team.find(params[:id])

INSERT INTO "teams" ("first_name", "last_name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["first_name", "Kevin"], ["last_name", "Terpstra"], ["created_at", 2016-03-19 15:41:13 UTC], ["updated_at", 2016-03-19 15:41:13 UTC], ["user_id", 1]]
---
  def create
    @team = Team.new(team_params)
    @team.user_id = current_user.id

    if @team.save