app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "first_name", "last_name", "email", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save